USE SeaTurtleOnTheWay;
GO



--會員
INSERT INTO Member.tMember ( fAccount, fPassword, fName, fBirthdate, fMail, 
                            fAddress, fCity, fCeilphoneNumber, fCoins, 
							fPhotoPath, fAccountTypeId, fIntroduction ) 
VALUES ('root', 'FAlonDAfaISgood666', '管理員', '2000/02/20', 'cycle2link@gmail.com', 
        '復興南路一段390號2樓', '台北市', 0989859112, 100000,
	    null, 0, '沙漠中一無所有，一無所有非人所求也。'), 
		('guest', 'badiii7777', '訪客', '2000/02/20', 'cycle2link@gmail.com', 
        '復興南路一段390號2樓', '台北市', 0989859112, 0,
	    null, 0, '沙漠中一無所有，一無所有非人所求也。'), 
		('romazrau', '55688app', '饒孝天', '2000/02/20', 'A222222222@gmail.com', 
        '南港區南港路2段222號2樓之2', '台北市', 0989859112, 2222,
		'member/id1.jpg', 1, '沙漠中一無所有，一無所有非人所求也。'), 
		('AndyKao123', 'j123456789', '郭安迪', '1987/08/07', 'O222132435@gmail.com', 
        '南投縣魚池鄉富錦路33-1號', '南投縣', 0934999444, 2567,
		'member/id2.jpeg', 2,'幻想拯救世界的積極環保人士一枚'),
		('Wwill', 'w134667', '王威比', '1988/02/19', 'A125453792@gmail.com', 
        '中山區民生東路二段78號3樓', '台北市', 0913345168, 3700,
		'member/id3.jpg', 1, '佛系環保人士，盡量隨身攜帶環保餐具，偶爾還是會不爭氣地拿塑膠吸管，淨灘其實蠻好玩的，大家都是有趣的人～'),
		('JL1992', 'ss66789', '劉日', '1992/01/29', 'F229842651@hotmail.com', 
        '板橋區中山路二段87號', '新北市', 0921021027, 9999,
		'member/id4.jpeg', 1, '安安你好'),
		('aaa123', 'ww8787', '陳佑銘', '1993/09/06', 'A122465898@gmail.com', 
        '台北市大安區和平東路二段106號11樓', '台北市', 0926324123, 6666,
		null, 1, '這個會員沒有留下什麼'),
		('ddd555', 'ddd888', '蟑笑犬', '2012/4/1', 'A123456789@gmail.com', 
        '台北市中山區林森北路372號2樓', '台北市', 0987948787, 1200,
		null, 1, '你好 我是跳級生');






---------------------------------------------------------------------------------------
--  社團 
INSERT INTO Community.tCommunity( fName, fStatusId, fDate, fInfo, fImgPath, fClassId)
VALUES('北區淨灘團',0,'2020/4/16','活動地區以北北基為主，開放大家投票討論下一次淨灘地點～', '', 1),
      ('熱血跑步魂',1,'2020/7/23','跑步是為了找到內心的平靜，生命要過得好也是如此。', '', 2),
	  ('寶寶長大拉',0,'2020/1/11','明明東西還很新，快拿出來給下一個需要的寶寶', '', 0),
	  ('一時暴雷一時爽',2,'2020/5/2','一直暴雷一直爽', '', 0);

INSERT INTO Community.tMemberList(fCommunityId,fMemberId,fJoinDate,fAccessRightId)
VALUES(1,2,'2020/4/16',3),(1,3,'2020/4/18',2),(1,4,'2020/4/20',2),(1,6,'2020/4/16',2),
	(1,7,'2020/7/30',3),
		(2,2,'2020/7/30',2),(2,4,'2020/7/30',2),(2,5,'2020/7/30',2),(2,6,'2020/7/30',3),
		(2,7,'2020/7/30',2)	


---------------------------------------------------------------------------------------
--  活動
insert into Activity.tActivity(fActName,fCreatDate,fActivityDate,fActivityEndDate,fMemberId,fIntroduction,
            fImgPath, fActLabelID, fMaxLimit,fMinLimit,fActAttestId,fActTypeId,fActLocation, fCoordinateX, fCoordinateY)  
			-- fActLabelID1,fActLabelID2,fActLabelID3,fActLabelID4,fActLabelID5,fActLocation )
values('2020國家地理路跑-世界地球日50週年','2020/03/09','2020/08/09 12:00','2020/08/09 14:00:00' ,4,'https://www.eventpal.com.tw/FOAS/actions/ActivityIndex.action?showTabContent&seqno=9db4bc32-d8ef-473f-8bcd-e17840edab64',
        '', 2, 100,10,0,0,'台北', 25.071874, 121.5802),
		--'路跑','世界地球日',null,null,null),
	  ('魚取漁囚 - 守護海洋行動體驗特展','2020/03/09','2020/08/09 12:00:00','2020/08/09 14:00:00', 4,'https://www.google.com',
        '', 3, Null, Null,0,0,'基隆', 25.007839, 121.494713),
		--'守護海洋','世界地球日',null,null,null),
      ('Plogging淨街慢跑-迪化街','2020/02/13','2020/07/19 13:00:00','2020/07/19 16:00:00', 4,'https://blog.decathlon.tw/running/sport-knowledge/plogging',
        '', 2, 80, 5,0,2,'台北', 25.133756, 121.36425),
		--'守護海洋','世界地球日',null,null,null),
	  ('環保潛水隊-隊員招募中','2020/04/22','2020/09/01 10:00:00','2020/08/09 14:00:00',  4,'https://news.ltn.com.tw/news/local/paper/1286949',
        '', 0, 30, Null,0,2,'台東', 25.283227, 121.525955),
		--'潛水','環保','海洋垃圾','培訓',null),
	  ('臉部平權運動臺北國道馬拉松','2020/05/01','2020/09/06 18:00:00','2020/09/06 20:00:00',  4,'https://www.sportsnet.org.tw/20200308_web/',
        '', 2, 50, Null,0,2,'台北', 24.979212, 121.624832),
		--'潛水',null,null,null,null),
	  ('世界環境清潔日 相約海洋淨灘','2020/06/12','2020/08/26 20:00:00','2020/08/26 22:00:00',  4,'http://letsdoittaiwan.tw/2018worldcleanupday/coastline/',
        '', 1, 10, Null,0,2,'台東', 25.230442, 121.645088),
		--'淨灘',null,null,null,null),
	  ('天母二手市集','2020/09/07','2020/09/01 12:00:00','2020/09/01 15:00:00', 4,'https://vivawei.tw/tianmu-market/',
        '', 4, 150, 20,0,2,'台北', 25.117735, 121.528873), --,'二手市集','跳蚤市場','挖寶趣','斷捨離',null),
	  ('鳥兒哪裡去八里濕地野鳥觀察','2020/08/01','2020/08/02 16:00:00','2020/08/02 20:00:00', 1,'https://www.google.com',
        '', 3, 20, Null,0,0,'新北',25.116668,  121.383476), --,'鳥類觀察','生態觀察','踏青',null,null),
	  ('城市獵人-富陽生態公園夜觀','2020/08/10','2020/08/20 17:00:00','2020/08/20 21:00:00',  1,'https://www.google.com',
        '', 3, 20, Null,0,0,'新北', 25.0151, 121.5593), --'鳥類觀察','生態觀察','踏青',null,null),
      ('大風吹，吹什麼? 園藝寶貝交換活動','2020/06/10','2020/08/13 10:00:00','2020/08/13 18:00:00',  1,'https://www.google.com',
        '', 4, Null, Null,0,4,'新北', 24.161435,120.670738), --'園藝','二手市集','花卉',null,null),
	  ('荒野保護協會【2020工作假期】萬里工作日','2020/06/15','2020/08/08 11:00:00','2020/08/08 14:30:00',5,'https://www.sow.org.tw/civicrm/event/info?reset=1&id=9075',
        '', 3, Null, 5,0,0,'新北', 25.178855, 121.673241), --'荒野保護協會','環保','棲地工作',null,null),
	  ('【愛海無距~誰是沙害者】~ 2020國際淨灘行動','2020/07/27','2020/08/16 10:00:00','2020/08/16 14:00:00', 5,'https://www.sow.org.tw/civicrm/event/info?reset=1&id=9568',
        '', 1, 60, 15,0,1,'新北',24.175516, 120.475388), --'荒野保護協會','環保','棲地工作',null,null),
	  ('2020筏子溪常態性淨溪','2020/06/02','2020/09/06 18:00:00','2020/09/06 20:00:00', 5,'https://www.sow.org.tw/civicrm/event/info?reset=1&id=9374',
        '', 1, 30, Null,0,0,'花蓮', 24.152464, 120.621943),  --'淨溪','荒野保護協會','環保','踏青','環保行動'),
	  ('2020植樹','2020/05/03','2020/09/01 13:00:00','2020/09/01 19:00:00' , 6,'https://udn.com/news/story/7324/4400884',
        '', 3, 20, Null,0,0,'台中', 24.167682, 120.755196),  --'環保','城市綠洲',null,null,null),
	  ('PUMA環保愛地球 ','2020/06/06','2020/08/09 11:00:00','2020/08/09 15:00:00', 6,'https://www.puma-nightrun.com.tw/competition_info.php',
        '', 4, 50, Null,0,1,'花蓮', 24.193377, 120.732193),  --'環保','路跑',null,null,null),
	  ('換換二手衣物換換愛','2020/10/20','2020/09/11 12:30:00','2020/09/11 18:00:00', 2,'https://www.google.com',
        '', 4, null, 20,0,0,'彰化',24.17301, 120.665932),  --'換物','二手','交流','環保愛地球','環保小尖兵'),
	  ('綠的手作坊-漂流木新生命','2020/09/07','2020/08/31 10:00:00','2020/08/31 14:00:00', 2,'https://www.google.com',
        '', 1, 5, Null, 0, 0,'高雄', 24.20309, 120.618896),  --'漂流木','環保','手作','環境行動','環保愛地球'),
	  ('篇鄉關懷，愛心捐物','2020/05/04','2020/08/09 15:30:00','2020/08/09 18:30:00', 2,'https://www.google.com',
        '', 4, null, Null,0,4,'高雄',24.11126, 120.642929)   --'原民','捐物','愛心關懷','環保行動','環保愛地球');
	  
---------------------------------------------------------------------------------------
--  商品標籤

insert into sMessage.tMessage(fMemberID,fContent) 
VALUES(1,'成功加入社團'),(1,'已加入活動'),(2,'成功加入社團'), (4,'活動人數不足,活動未成立'),(3,'成功加入社團'),(5,'等待審核請稍後~')