-- 建立 Deom 資料用
---------------------------------------
USE SeaTurtleOnTheWay;
GO

--清空資料表
--DELETE FROM Member.Member;


---------------------------------------------------------------------------------------
-- 會員
INSERT INTO Member.tMember ( fAccount, fPassword, fName, fBirthdate, fIdentifyId, 
                            fAddress, fCity, fCeilphoneNumber, fCoins, 
							fGender, fPhotoPath, fAccountTypeId, fIntroduction ) 
VALUES ('romazrau', '55688app', '饒孝天', '2000/02/20', 'A222222222', 
        '南港區南港路2段222號2樓之2', '台北市', 0989859112, 2222,
		'女', 'member/id1.jpg', 1, '沙漠中一無所有，一無所有非人所求也。'), 
		('AndyKao123', 'j123456789', '郭安迪', '1987/08/07', 'O222132435', 
        '南投縣魚池鄉富錦路33-1號', '南投縣', 0934999444, 2567,
		'男', 'member/id2.jpeg', 2,'幻想拯救世界的積極環保人士一枚'),
		('Wwill', 'w134667', '王威比', '1988/02/19', 'A125453792', 
        '中山區民生東路二段78號3樓', '台北市', 0913345168, 3700,
		null, 'member/id3.jpg', 1, '佛系環保人士，盡量隨身攜帶環保餐具，偶爾還是會不爭氣地拿塑膠吸管，淨灘其實蠻好玩的，大家都是有趣的人～'),
		('JL1992', 'ss66789', '劉日', '1992/01/29', 'F229842651', 
        '板橋區中山路二段87號', '新北市', 0921021027, 9999,
		null, 'member/id4.jpeg', 1, '安安你好'),
		('aaa123', 'ww8787', '陳佑銘', '1993/09/06', 'A122465898', 
        '台北市大安區和平東路二段106號11樓', '台北市', 0926324123, 6666,
		'男', null, 1, '這個會員沒有留下什麼'),
		('ddd555', 'ddd888', '蟑笑犬', '2012/4/1', 'A123456789', 
        '台北市中山區林森北路372號2樓', '台北市', 0987948787, 1200,
		'男',  null, 1, '你好 我是跳級生');


-- create Member.tAccountLikeList
INSERT INTO Member.tAccountLikeList ( fGetLikeMemberId, fGiveLikeMemberId )
    VALUES ( 3 , 1 ),
	       ( 3 , 2 ),
		   ( 3 , 4 ),
		   ( 4 , 3 );




---------------------------------------------------------------------------------------
--  社團 
INSERT INTO Community.tCommunity( fName, fStatusId, fDate, fInfo, fImgPath)
VALUES('北區淨灘團',0,'2020/4/16','活動地區以北北基為主，開放大家投票討論下一次淨灘地點～', ''),
      ('熱血跑步魂',1,'2020/7/23','跑步是為了找到內心的平靜，生命要過得好也是如此。', ''),
	  ('寶寶長大拉',0,'2020/1/11','明明東西還很新，快拿出來給下一個需要的寶寶', ''),
	  ('一時暴雷一時爽',2,'2020/5/2','一直暴雷一直爽', '');




---------------------------------------------------------------------------------------
--  活動
insert into Activity.tActivity(fActName,fCreatDate,fActivityDate,fMemberId,fIntroduction,
            fActLabelID, fLimit,fActAttestId,fActTypeId,fActLocation, fCoordinateX, fCoordinateY)  
			-- fActLabelID1,fActLabelID2,fActLabelID3,fActLabelID4,fActLabelID5,fActLocation )
values('2020國家地理路跑-世界地球日50週年','2020/03/09','2020/08/09' ,4,'https://www.eventpal.com.tw/FOAS/actions/ActivityIndex.action?showTabContent&seqno=9db4bc32-d8ef-473f-8bcd-e17840edab64',
        2, 100,0,0,'台北', 0, 0),
		--'路跑','世界地球日',null,null,null),
	  ('魚取漁囚 - 守護海洋行動體驗特展','2020/03/09','2020/08/09', 4,'https://www.google.com',
        3, Null,0,0,'基隆', 0, 0),
		--'守護海洋','世界地球日',null,null,null),
      ('Plogging淨街慢跑-迪化街','2020/02/13','2020/07/18', 4,'https://blog.decathlon.tw/running/sport-knowledge/plogging',
        2, 80,0,2,'台北', 0, 0),
		--'守護海洋','世界地球日',null,null,null),
	  ('環保潛水隊-隊員招募中','2020/04/22','2020/08/03',  4,'https://news.ltn.com.tw/news/local/paper/1286949',
        0, 30,0,2,'台東', 0, 0),
		--'潛水','環保','海洋垃圾','培訓',null),
	  ('臉部平權運動臺北國道馬拉松','2020/05/01','2020/09/06',  4,'https://www.sportsnet.org.tw/20200308_web/',
        2, 50,0,2,'台北', 0, 0),
		--'潛水',null,null,null,null),
	  ('世界環境清潔日 相約海洋淨灘','2020/06/12','2020/09/15',  4,'http://letsdoittaiwan.tw/2018worldcleanupday/coastline/',
        1, 10,0,2,'台東', 0, 0),
		--'淨灘',null,null,null,null),
	  ('天母二手市集','2020/09/07','2020/10/13', 4,'https://vivawei.tw/tianmu-market/',
        4, 150,0,2,'台北', 0, 0), --,'二手市集','跳蚤市場','挖寶趣','斷捨離',null),
	  ('鳥兒哪裡去八里濕地野鳥觀察','2020/08/01','2020/08/22', 1,'https://www.google.com',
        3, 20,0,0,'新北', 0, 0), --,'鳥類觀察','生態觀察','踏青',null,null),
	  ('城市獵人-富陽生態公園夜觀','2020/08/10','2020/10/10',  1,'https://www.google.com',
        3, 20,0,0,'新北', 0, 0), --'鳥類觀察','生態觀察','踏青',null,null),
      ('大風吹，吹什麼? 園藝寶貝交換活動','2020/06/10','2020/07/20',  1,'https://www.google.com',
        4, Null,0,4,'新北', 0, 0), --'園藝','二手市集','花卉',null,null),
	  ('荒野保護協會【2020工作假期】萬里工作日','2020/06/15','2020/08/08',5,'https://www.sow.org.tw/civicrm/event/info?reset=1&id=9075',
        3, Null,0,0,'新北', 0, 0), --'荒野保護協會','環保','棲地工作',null,null),
	  ('【愛海無距~誰是沙害者】~ 2020國際淨灘行動','2020/07/27','2020/09/19', 5,'https://www.sow.org.tw/civicrm/event/info?reset=1&id=9568',
        1, 60,0,1,'新北', 0, 0), --'荒野保護協會','環保','棲地工作',null,null),
	  ('2020筏子溪常態性淨溪','2020/06/02','2020/08/01', 5,'https://www.sow.org.tw/civicrm/event/info?reset=1&id=9374',
        1, 30,0,0,'花蓮', 0, 0),  --'淨溪','荒野保護協會','環保','踏青','環保行動'),
	  ('2020植樹','2020/05/03','2020/06/30' , 6,'https://udn.com/news/story/7324/4400884',
        3, 20,0,0,'台中', 0, 0),  --'環保','城市綠洲',null,null,null),
	  ('PUMA環保愛地球 ','2020/06/06','2020/08/30', 6,'https://www.puma-nightrun.com.tw/competition_info.php',
        4, 50,0,1,'花蓮', 0, 0),  --'環保','路跑',null,null,null),
	  ('換換二手衣物換換愛','2020/10/20','2020/11/08', 2,'https://www.google.com',
        4, null,0,0,'彰化', 0, 0),  --'換物','二手','交流','環保愛地球','環保小尖兵'),
	  ('綠的手作坊-漂流木新生命','2020/09/07','2020/10/01', 2,'https://www.google.com',
        1, 5, 0, 0,'高雄', 0, 0),  --'漂流木','環保','手作','環境行動','環保愛地球'),
	  ('篇鄉關懷，愛心捐物','2020/05/04','2020/08/06', 2,'https://www.google.com',
        4, null,0,4,'高雄', 0, 0)   --'原民','捐物','愛心關懷','環保行動','環保愛地球');
	  
---------------------------------------------------------------------------------------
--  商品標籤

INSERT INTO Product.tProductTag (fName) 
VALUES ('廚房用品'),('食物料理棒'),('斷捨離'),('尾牙還是現金好'),('環保'),('梅森罐'),('文青'),('日常用品'),('玩偶公仔'),('恐龍'),('全新僅拆封'),('小朋友最愛'),('沒有買賣沒有傷害'),('全聯點數'),('活動期間9/3-10/5'),('專業清潔'),('特殊需求內議'),('打掃完像新家'),('以工換酬'),('效果器'),('電吉他'),('無線喇叭'),('Airplay'),('wifi'),('PS4'),('史努比'),('提袋'),('Dr.martens'),('馬汀'),('八孔'),('電子產品'),('自拍'),('桌上型燈架'),('直播用具'),('環形燈'),('燈具'),('睡眠'),('聲控'),('光源'),('板橋'),('變速腳踏車'),('自行車'),('桃園'),('捷安特'),('代步車'),('後背包'),('Anello'),('陣營'),('桌遊'),('紙牌遊戲'),('策略'),('派對遊戲'),('交朋友'),('博弈'),('床架'),('家具'),('質感'),('電動'),('掌上型'),('全新未拆封'),('老少咸宜'),('健身器材'),('按摩'),('機票'),('旅遊'),('挑戰'),('孔雀魚'),('魚'),('水族'),('手機'),('安卓手機'),('3C'),('WindowsPhone'),('行動電源 '),('精靈球'),('精靈寶可夢'),('磁鐵'),('海蛞蝓'),('可愛'),('海洋'),('療癒小物'),('畫'),('文創'),('手作'),('二手書'),('卡內基'),('伯爵茶'),('婚姻平權'),('coach'),('手環'),('全新'),('名牌'),('禮物');
    
---------------------------------------------------------------------------------------
--  商品
INSERT INTO Product.tProduct (fName, fPrice, fDate, fDetail, fPath, fMemberId, fDelivery)
VALUES ('百靈BRAUN食物料理棒MQ9045',2200,'2020-06-03','尾牙抽到，但是平常沒有下廚的習慣，僅拆封並未使用過。有點占空間，便宜出清～',
        'path-fdagda',3,10),
		('美國 Ball 梅森罐 + reCAP 寬口飲料隨行杯組(紅色)',150,'2020-03-01','跟朋友一起合購買的，有用過幾次，但覺得太重了，又比較常帶小包包，只好忍痛出清平常都有好好清潔，沒有什麼使用痕跡，歡迎聊聊',
         'path-fddag54644',3,20),
		 ('三角龍玩偶',200,'2020-07-22','全新，買了三角龍娃娃要給朋友的小孩，結果他說比較喜歡暴龍QQ明明三角龍就很可愛，希望下一個主人可以好好愛護他',
          'path-ewrh324',3,12),
		 ('全聯點數55點',100,'2020-09-18','有人需要集點嗎？這次檔期的東西沒有很想換，有人需要的話趕快把握唷！',
		 'path-fdsagku3',3,1),
		 ('清潔打掃',300,'2020-08-16','我超級擅長打掃的，而且也不怕蟑螂。急需海龜幣，可以聊聊討論時間和細節。',
		 'path-45hterr',3,1),
		 ('LINE 6 Dr. Distorto 電吉他 Distortion 破音效果器',1500,'2020-07-22','有一次不知道為什麼失心瘋就買了這個效果器，但只用過一次就沒再用了，想讓給有緣人',
		 'path-gfsjior',4,10),
		 ('TuneBox-音響升級為Wi-Fi無線',1200,'2020-05-26','想直接讓手機用無線的方式讓喇叭播音樂嗎？選這台就對了！無線音樂串流升級專屬配件，支援 AirPlay與DLNA',
		 'path-325jffd',4,1),
		 ('槍彈辯駁 1、2 Reload',1600,'2020-04-10','已破台，PS4必玩，請入手。',
		 'path-hyidjytf5',4,6),
		 ('PEANUTS史努比羊羔毛提袋',350,'2020-06-17','買了以後沒用過也沒打開過，袋子很多了因此售出，喜歡史努比的你會想要嗎>_<...',
		 'path-gfecu6',4,5),
		 ('Dr.martens馬汀八孔厚底經典款EU36',3200,'2020-08-02','正品、限量、側拉鍊，原3880極新二手購入，僅在家試穿，不議價',
		 'path-7dgddf',4,1),
		 ('網路直播 USB LED 10吋環形燈',800,'2020/7/10','放棄當youtuber，沒用過幾次。自拍攝影美顏補光燈，可調光及色溫，適用在家線上直播',
		 'path-42tase',5,3),
		 ('米家床頭燈',600,'2020/6/4','禮物抽到，用不著便宜賣',
		 'path-45ytr',5,13),
		 ('捷安特變速腳踏車',1300,'2020/7/1','放一陣子沒用，占空間出清',
		 'path-1sad',5,1),
		 ('Anello後揹黑色包包',360,'2020/7/20','大學新生超實用的後揹包，上班上課外出超實用很輕',
		 'path-jj8gfr',5,11),
		 ('桌遊阿瓦隆',100,'2020/6/23','邊緣人找不到朋友一起玩，只開過兩次',
		 'path-3fdj',5,1),
		 ('麻將-海賊王',500,'2020/04/01','魯夫成為海賊王後，周邊商品 ',
		 'path-7hjgh',5,10),
		 ('IKEA床架',3000,'2020/6/15','9成新，買房全部家具換新',
		 'path-vda2',5,10),
		 ('switch-動森版',5000,'2020/6/29','全新，還沒拆封，本來想要出差隔離的時候玩，但太危險還是決定把老闆Fire了，要賺點生活費',
		 'path-mnh15h',6,13),
		 ('筋膜槍',1000,'2020/1/6','9成新，本來要給自己健身的決心，但是脂肪肝想跟我當好朋友，所以忍痛割賣',
		 'path-ytr645',6,13),
		 ('武漢機票去成機票',500,'2020/1/22','尾牙抽到，但已經去過了，留給想要前往武漢救災的善心人士',
		 'path-ny4te',6,13),
		 ('孔雀魚-驚喜色',10,'2020/07/27','孔雀魚生小魚，可交換水草(睡蓮、小榕)',
		 'path-nbo0u',1,13),
		 ('htc uu',1000,'2020/07/27','白色，2年使用，背板破裂，功能正常',
		 'path-mjtypt7',1,13),
		 ('Nokia lumia 720',500,'2020/07/27','黑色，2年使用，背板破裂，功能正常',
		 'path-54ht',1,13),
		 ('Microsoft lumia 950',1000,'2020/07/27','白色，2年使用，背板掉漆，功能正常',
		 'path-3254fg',1,13),
		 ('1000豪安培，精靈球造型行動電源',1000,'2020/07/27','外觀9成9新，少於10次循環充電',
		 'path-7ykoy',1,13),
		 ('海蛞蝓磁鐵全新',500,'2020/08/29','全新一比一紫色海蛞蝓磁鐵，貼在冰箱超可愛！',
		 'path-9kjol',2,13),
		 ('壓克力無框畫世界唯一',5000,'2020/07/30','手作畫，外澳伯朗咖啡館',
		 'path-3fhr',2,13),
		 ('如何停止憂慮開創人生卡內基',500,'2020/06/20','卡內基二收書',
		 'path-6hgdf',2,13),
		 ('罐裝伯爵紅茶',1000,'2020/08/18','芬蘭購入，同志婚姻平權！',
		 'path-xzfds3',2,13),
		 ('coach手環全新',6000,'2020/08/08','全新coach手環，朋友送不喜故售出',
		 'path-57nkglng',2,13);

-- 面交地點
INSERT INTO Product.tFaceToFace(fProductId, fDelivery, fCoordinateX, fCoordinateY)
VALUES (1,10,25.0208222,121.4621559),
       (3,12,25.0349162,121.4889309),
	   (4,1,25.0442434,121.516285),
	   (5,1,25.080332,121.5413714);

-- 商品搜尋列表
INSERT INTO Product.tSearchingRecord(fProductId, fMemberId, fTime)
VALUES (12,1,2020-08-30),
       (21,3,2020-07-30),
       (30,4,2020-06-30),
       (15,6,2020-06-30),
       (7,6,2020-07-30),
       (18,6,2020-07-30),
       (22,6,2020-07-30);

-- 商品留言
INSERT INTO Product.tQnA(fProductId, fMemberId, fTime, fMessage)
VALUES (1,2,2020-08-30,'請問這還有嗎?'),
       (3,2,2020-07-30,'大小大概多大呢?');

-- 留言回覆
INSERT INTO Product.tReply(fQnAId, fMemberId, fTime, fMessage)
VALUES (1,3,2020-08-30,'還有唷，趕快下標~'),
       (2,3,2020-07-30,'大概2公尺高哦');

-- 商品五個標籤
INSERT INTO Product.tProduct5Tag(fProductId, fProductTagId)
VALUES(1,93),(1,1),(1,2),(1,10),(1,3),
      (2,4),(2,5),(2,6),(2,7),
      (3,8),(3,9),(3,10),(3,11),(3,12),
      (4,13),(4,14),
      (5,15),(5,16),(5,17),(5,18),
      (6,19),(6,20),
      (7,21),(7,22),(7,23),
      (8,24),
      (9,25),(9,26),
      (10,27),(10,28),(10,29),
      (11,30),(11,31),(11,32),(11,33),(11,34),
      (12,35),(12,36),(12,37),(12,38),(12,39),
      (13,40),(13,41),(13,42),(13,43),(13,44),
      (14,45),(14,46),
      (15,47), (15,48), (15,49), (15,50), (15,51),
      (16,48),(16,52),(16,53),
      (17,54),(17,55),(17,56),
      (18,57),(18,58),(18,59),(18,60),(18,56),
      (19,60),(19,61),(19,62),
      (20,63),(20,64),(20,65),
      (21,66),(21,67),(21,68),
      (22,69),(22,70),(22,71),
      (23,69),(23,72),(23,71),
      (24,69),(24,72),(24,71),
      (25,73),(25,74),(25,75),
      (26,76),(26,77),(26,78),(26,79),(26,80),
      (27,81),(27,82),(27,83),
      (28,84),(28,85),
      (29,86),(29,87),
      (30,88), (30,89), (30,90), (30,91), (30,92);

---------------------------------------------------------------------------------------
--  訂單

-- 訂單
Insert Into Sales.tOrders (fDate, fProductId, fMemberId, fOrdersStatusId, fDeliveryId)
Values ('2020/06/20',1,3,6,10),
       ('2020/06/28',2,3,3,20),
	   ('2020/07/02',3,3,5,12),
	   ('2020/07/05',4,3,4,1),
	   ('2020/07/10',5,3,1,1);

-- 訂單評分
Insert Into Sales.tRate (fRating,fRateDate,fRateText)
Values (4,'2020/06/20','出貨速度超快唷')